Revit 2024 API
BuiltInFailures.StairRampFailures.StairsSupportOverlapFailure Property
 Some supports overlap with others
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsSupportOverlapFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsSupportOverlapFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsSupportOverlapFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace